In [1]:
import numpy as np
import pandas as pd

In [7]:
sozluk_1 = {"İsim": ["Ahmet","Mehmet","Ayşe","Derya"],
           "Spor" : ["Yüzme","Futbol","Koşu","Jimnastik"],
           "Kalori": [300,300,100,200]}
#3 tane farklı sözlük oluşturuyorum hepsinin içeriği aynı

In [8]:
data_frame_1 = pd.DataFrame(sozluk_1,index=[0,1,2,3])

In [9]:
data_frame_1

     İsim       Spor  Kalori
0   Ahmet      Yüzme     300
1  Mehmet     Futbol     300
2    Ayşe       Koşu     100
3   Derya  Jimnastik     200

In [14]:
sozluk_2 = {"İsim": ["Ali","Nur","Selin","Burcu"],
           "Spor" : ["Yüzme","Tenis","Koşu","Jimnastik"],
           "Kalori": [400,200,150,100]}

In [15]:
data_frame_2 = pd.DataFrame(sozluk_2,index=[4,5,6,7])

In [22]:
sozluk_3 = {"İsim": ["İsmail","Hasan","Ece","Oğuz"],
           "Spor" : ["Basketbol","Futbol","Koşu","Voleybol"],
           "Kalori": [250,150,150,300]}

In [23]:
data_frame_3 = pd.DataFrame(sozluk_3,index=[8,9,10,11])

In [24]:
data_frame_2

    İsim       Spor  Kalori
4    Ali      Yüzme     400
5    Nur      Tenis     200
6  Selin       Koşu     150
7  Burcu  Jimnastik     100

In [25]:
data_frame_3

      İsim       Spor  Kalori
8   İsmail  Basketbol     250
9    Hasan     Futbol     150
10     Ece       Koşu     150
11    Oğuz   Voleybol     300

## concatenation

In [26]:
#aynı olan columnları birleştirmeye yarıyor

In [27]:
pd.concat([data_frame_1,data_frame_2,data_frame_3])
#axis belirtmeyince oto olarak 0 alır

      İsim       Spor  Kalori
0    Ahmet      Yüzme     300
1   Mehmet     Futbol     300
2     Ayşe       Koşu     100
3    Derya  Jimnastik     200
4      Ali      Yüzme     400
5      Nur      Tenis     200
6    Selin       Koşu     150
7    Burcu  Jimnastik     100
8   İsmail  Basketbol     250
9    Hasan     Futbol     150
10     Ece       Koşu     150
11    Oğuz   Voleybol     300

In [28]:
pd.concat([data_frame_1,data_frame_2,data_frame_3],axis=0)

      İsim       Spor  Kalori
0    Ahmet      Yüzme     300
1   Mehmet     Futbol     300
2     Ayşe       Koşu     100
3    Derya  Jimnastik     200
4      Ali      Yüzme     400
5      Nur      Tenis     200
6    Selin       Koşu     150
7    Burcu  Jimnastik     100
8   İsmail  Basketbol     250
9    Hasan     Futbol     150
10     Ece       Koşu     150
11    Oğuz   Voleybol     300

In [29]:
pd.concat([data_frame_1,data_frame_2,data_frame_3],axis=1)
#axis 1 olsa yan yan yana koymaya çalışacakolmayan veriler nan yazacaktı

,İsim,Spor,Kalori,İsim,Spor,Kalori,İsim,Spor,Kalori
0,Ahmet,Yüzme,300.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Futbol,300.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Ayşe,Koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Derya,Jimnastik,200.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Ali,Yüzme,400.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Nur,Tenis,200.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Selin,Koşu,150.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Burcu,Jimnastik,100.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,İsmail,Basketbol,250.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Hasan,Futbol,150.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Ece,Koşu,150.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Oğuz,Voleybol,300.0

## merge

In [30]:
#bu da birleştirmek, kaynaştırmak anlamına gelir

In [31]:
merge_sozluk_1=  {"İsim": ["Bilge","Arda","Hatice","Deniz"],
           "Spor" : ["Yüzme","Futbol","Koşu","Voleybol"]}

In [32]:
merge_data_frame_1 = pd.DataFrame(merge_sozluk_1)

In [33]:
merge_data_frame_1

     İsim      Spor
0   Bilge     Yüzme
1    Arda    Futbol
2  Hatice      Koşu
3   Deniz  Voleybol

In [34]:
merge_sozluk_2=  {"İsim": ["Bilge","Arda","Hatice","Deniz"],
           "Kalori" : [450,400,200,250]}

In [35]:
merge_data_frame_2 = pd.DataFrame(merge_sozluk_2)

In [36]:
merge_data_frame_2

     İsim  Kalori
0   Bilge     450
1    Arda     400
2  Hatice     200
3   Deniz     250

In [37]:
pd.merge(merge_data_frame_1,merge_data_frame_2,on="İsim")
#iki framei ortak olan kolon üzerinden birleştirip tek hale getirdik
#ortak olan kolonu on= diyerek yazıyoruz

     İsim      Spor  Kalori
0   Bilge     Yüzme     450
1    Arda    Futbol     400
2  Hatice      Koşu     200
3   Deniz  Voleybol     250

In [41]:
maas_sozluk = {"İsim": ["Gökhan","Mustafa","Olcay","Tolga"],
              "Departman": ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas": [7400,7200,7600,7800]}

In [42]:
maas_data_frame = pd.DataFrame(maas_sozluk)

In [43]:
maas_data_frame

      İsim  Departman  Maas
0   Gökhan    Yazılım  7400
1  Mustafa      Satış  7200
2    Olcay  Pazarlama  7600
3    Tolga    Yazılım  7800

In [44]:
maas_data_frame["Departman"]
#sadece departmanları getirir

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [45]:
maas_data_frame["Departman"].unique()
#tekrar etmeyecek şekilde getirir

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [46]:
maas_data_frame["Departman"].nunique()
#direkt olarak departmanların sayısını getirir

3

In [49]:
maas_data_frame["Departman"].value_counts()
#her departmanda kaç kişi olduğunu gösterir

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

In [52]:
def brutten_nete(maas):
    return maas*0.76

In [53]:
maas_data_frame["Maas"]

0    7400
1    7200
2    7600
3    7800
Name: Maas, dtype: int64

In [54]:
maas_data_frame["Maas"].apply(brutten_nete)
#bir fonksiynu frame içinde uyguladık

0    5624.0
1    5472.0
2    5776.0
3    5928.0
Name: Maas, dtype: float64

In [56]:
maas_data_frame.isnull()
#null değeri olup olmadığının kontrolü

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [57]:
yeni_bir_veri = {"Karakter Sınıfı" : ["HIMYM","HIMYM","GOT","GOT"],
                "Karakter İsmi": ["Ted","Barney","Jon","Robb"],
                "Karakter Yas": [25,28,21,21]}

In [58]:
karakter_data_frame = pd.DataFrame(yeni_bir_veri)

In [59]:
karakter_data_frame

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0           HIMYM           Ted            25
1           HIMYM        Barney            28
2             GOT           Jon            21
3             GOT          Robb            21

In [60]:
karakter_data_frame.pivot_table(values = "Karakter Yas", index= ["Karakter Sınıfı","Karakter İsmi"])
#pivot table olarak ayırdık

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
GOT             Jon                      21
                Robb                     21
HIMYM           Barney                   28
                Ted                      25

In [67]:
deneme_veri = yeni_bir_veri = {"Karakter Sınıfı" : ["HIMYM","HIMYM","GOT","GOT","GOT"],
                "Karakter İsmi": ["Ted","Barney","Jon","Robb","Jon"],
                "Karakter Yas": [25,28,21,21,15]}

In [68]:
karakter_data_frame_2 = pd.DataFrame(deneme_veri)

In [69]:
karakter_data_frame_2

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0           HIMYM           Ted            25
1           HIMYM        Barney            28
2             GOT           Jon            21
3             GOT          Robb            21
4             GOT           Jon            15

In [70]:
karakter_data_frame_2.pivot_table(values = "Karakter Yas", index= ["Karakter Sınıfı","Karakter İsmi"])
#2 tane jon old. için ortalamasını aldı

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
GOT             Jon                      18
                Robb                     21
HIMYM           Barney                   28
                Ted                      25

In [71]:
karakter_data_frame_2.pivot_table(values = "Karakter Yas", index= ["Karakter Sınıfı","Karakter İsmi"],aggfunc=np.sum)
# 2 tane Jon u toplasın istedim

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
GOT             Jon                      36
                Robb                     21
HIMYM           Barney                   28
                Ted                      25